export const FORM_TEXT = [
  '로그인',
  '아이디',
  '비밀번호',
  '비밀번호 확인',
  '회원가입',
  'SNS로 바로 시작하기', // 5
  '이름',
  '이메일',
  '최소 6자부터 최대 12자 가능',
  '영문(대소), 특수문자, 숫자 10자 이상',
  '가입하기', // 10
  '닉네임',
  '비밀번호 변경',
  '뒤로가기',
];

export const FORM_ERROR = [
  '아이디를 입력해주세요.',
  '비밀번호를 입력해주세요.',
  '아이디 혹은 비밀번호를 확인해주세요.',
  '이름을 입력해주세요.',
  '이메일을 입력해주세요',
  '아이디가 중복되었습니다.', // 5
  '아이디는 영문 소문자와 숫자 6자 이상으로 이루어져야 합니다.',
  '이메일이 중복되었습니다.',
  '올바른 이메일 형식이 아닙니다.',
  '영문(대소), 특수문자, 숫자 10자 이상으로 이루어져야 합니다.',
  '비밀번호를 확인해주세요.', // 10
  '비밀번호가 일치하지 않습니다.',
  '닉네임을 입력해주세요.',
];

export const FORM_CATCH_ERROR = [
  '이메일 중복 확인 중 오류가 발생했습니다.',
  '아이디 중복 확인 중 오류가 발생했습니다.',
  '폼 제출에 실패했습니다. 다시 시도해주세요.',
];

export const FORM_PLACEHOLDER = [
  '아이디를 입력해주세요.',
  '비밀번호를 입력해주세요.',
  '이름을 입력해주세요.',
  '이메일을 입력해주세요.',
  '**********',
  '닉네임을 입력해주세요.', // 5
];

export const MODAL_TEXT = [
  '확인',
  '회원가입에 성공했습니다.',
  '로그인 화면으로 이동합니다.',
  '비밀번호가 변경되었습니다.',
];
